Proyecto-Final-eCommerce/Entrega-Proyecto-N3/performance_test-cluster.txt
Phase started: unnamed (index: 0, duration: 1s) 00:44:29(-0300)

Phase completed: unnamed (index: 0, duration: 1s) 00:44:30(-0300)

--------------------------------------
Metrics for period to: 00:44:40(-0300) (width: 1.312s)
--------------------------------------

http.codes.200: ................................................................ 1611
http.request_rate: ............................................................. 1201/sec
http.requests: ................................................................. 1573
http.response_time:
  min: ......................................................................... 1
  max: ......................................................................... 54
  median: ...................................................................... 23.8
  p95: ......................................................................... 37.7
  p99: ......................................................................... 45.2
http.responses: ................................................................ 1611
vusers.completed: .............................................................. 95
vusers.created: ................................................................ 54
vusers.created_by_name.0: ...................................................... 54
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 314.4
  max: ......................................................................... 864.4
  median: ...................................................................... 742.6
  p95: ......................................................................... 837.3
  p99: ......................................................................... 854.2


--------------------------------------
Metrics for period to: 00:44:30(-0300) (width: 0.52s)
--------------------------------------

http.codes.200: ................................................................ 389
http.request_rate: ............................................................. 427/sec
http.requests: ................................................................. 427
http.response_time:
  min: ......................................................................... 2
  max: ......................................................................... 48
  median: ...................................................................... 22
  p95: ......................................................................... 40
  p99: ......................................................................... 45.2
http.responses: ................................................................ 389
vusers.completed: .............................................................. 5
vusers.created: ................................................................ 46
vusers.created_by_name.0: ...................................................... 46
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 300
  max: ......................................................................... 474.8
  median: ...................................................................... 415.8
  p95: ......................................................................... 432.7
  p99: ......................................................................... 432.7


All VUs finished. Total time: 4 seconds

--------------------------------
Summary report @ 00:44:32(-0300)
--------------------------------

http.codes.200: ................................................................ 2000
http.request_rate: ............................................................. 407/sec
http.requests: ................................................................. 2000
http.response_time:
  min: ......................................................................... 1
  max: ......................................................................... 54
  median: ...................................................................... 23.8
  p95: ......................................................................... 39.3
  p99: ......................................................................... 45.2
http.responses: ................................................................ 2000
vusers.completed: .............................................................. 100
vusers.created: ................................................................ 100
vusers.created_by_name.0: ...................................................... 100
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 300
  max: ......................................................................... 864.4
  median: ...................................................................... 727.9
  p95: ......................................................................... 837.3
  p99: ......................................................................... 854.2