Proyecto-Final-eCommerce/Entrega-Proyecto-N3/performance_test.txt
Phase started: unnamed (index: 0, duration: 1s) 00:45:00(-0300)

Phase completed: unnamed (index: 0, duration: 1s) 00:45:01(-0300)

--------------------------------------
Metrics for period to: 00:45:10(-0300) (width: 3.05s)
--------------------------------------

http.codes.200: ................................................................ 2000
http.request_rate: ............................................................. 667/sec
http.requests: ................................................................. 2000
http.response_time:
  min: ......................................................................... 4
  max: ......................................................................... 274
  median: ...................................................................... 115.6
  p95: ......................................................................... 149.9
  p99: ......................................................................... 186.8
http.responses: ................................................................ 2000
vusers.completed: .............................................................. 100
vusers.created: ................................................................ 100
vusers.created_by_name.0: ...................................................... 100
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 947.4
  max: ......................................................................... 2391.4
  median: ...................................................................... 2231
  p95: ......................................................................... 2369
  p99: ......................................................................... 2369


All VUs finished. Total time: 5 seconds

--------------------------------
Summary report @ 00:45:04(-0300)
--------------------------------

http.codes.200: ................................................................ 2000
http.request_rate: ............................................................. 334/sec
http.requests: ................................................................. 2000
http.response_time:
  min: ......................................................................... 4
  max: ......................................................................... 274
  median: ...................................................................... 115.6
  p95: ......................................................................... 149.9
  p99: ......................................................................... 186.8
http.responses: ................................................................ 2000
vusers.completed: .............................................................. 100
vusers.created: ................................................................ 100
vusers.created_by_name.0: ...................................................... 100
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 947.4
  max: ......................................................................... 2391.4
  median: ...................................................................... 2231
  p95: ......................................................................... 2369
  p99: ......................................................................... 2369